Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: When using `quarkus-resteasy-client` however, users must use `quarkus-resteasy-client-oidc-filter` to access the same functionality.
ja_jp: ただし、 `quarkus-resteasy-client` を使用する場合、ユーザーは同じ機能にアクセスするために `quarkus-resteasy-client-oidc-filter` を使用する必要があります。

source: When using `quarkus-resteasy-client` however, users must use `quarkus-resteasy-client-oidc-token-propagation` to access the same functionality.
ja_jp: ただし、 `quarkus-resteasy-client` を使用する場合、ユーザーは同じ機能にアクセスするために `quarkus-resteasy-client-oidc-token-propagation` を使用する必要があります。

source: When using `quarkus-resteasy-client`, users can use the `quarkus-keycloak-admin-client` to administer the target Keycloak instance by leveraging the rest client.
ja_jp: `quarkus-resteasy-client` を使用する場合、ユーザーは `quarkus-keycloak-admin-client` を使用して、RESTクライアントを活用して対象のKeycloakインスタンスを管理できます。

source: When using `quarkus-resteasy-client`, users can use the `quarkus-oidc-client-filter` extensions to acquire and refresh access tokens from OpenID Connect and OAuth 2.0 compliant Authorization Servers.
ja_jp: `quarkus-resteasy-client` を使用する場合、ユーザーは `quarkus-oidc-client-filter` エクステンションを使用して、OpenID Connect および OAuth 2.0 準拠の認可サーバーからアクセストークンを取得し、更新することができます。

source: When using `quarkus-resteasy-qute` the content negotiation is performed automatically. For more information, see the xref:resteasy_integration[RESTEasy Integration] section.
ja_jp: `quarkus-resteasy-qute` を使用する場合、コンテンツネゴシエーションは自動的に実行されます。詳しくは、 xref:resteasy_integration[RESTEasy Integration] の項をご覧ください。

source: When using `quarkus-resteasy-qute` the content negotiation is performed automatically. See <<resteasy_integration>>.
ja_jp: `quarkus-resteasy-qute` を使用している場合、コンテンツネゴシエーションは自動的に行われます。 link:#resteasy_integration[resteasy_integration]] を参照してください。

source: When using a PEM keystore, the following formats are supported:
ja_jp: PEM キーストアを使用する場合、次のフォーマットがサポートされます。

source: When using a local GraalVM installation, the native executable targets your local operating system (Linux, macOS, Windows etc). However, as a container may not use the same _executable_ format as the one produced by your operating system, we will instruct the Maven build to produce an executable by leveraging a container runtime (as described in <<#container-runtime,this section>>):
ja_jp: ローカルの GraalVM インストール環境を使用する場合、ネイティブ実行可能ファイルは、ローカルのオペレーティングシステム (Linux、macOS、Windows など) をターゲットにします。 しかし、コンテナーはオペレーティングシステムによって生成されたものと同じ _実行可能ファイル_ 形式を使用しない場合があるため、 (<<#container-runtime,this section>> セクションで説明されているように) コンテナーランタイムを活用して実行可能ファイルを生成するように Maven ビルドに指示します。

source: When using a reactive and asynchronous execution model, you cannot use the same mechanism. To avoid using many process threads, and reduce resource usage (and also increase the concurrency of the application), the same thread can be used to handle multiple concurrent processing. Thus, you cannot use `ThreadLocals` as the values would be leaked between the various concurrent processing.
ja_jp: リアクティブ実行モデルと非同期実行モデルを使用する場合、同じメカニズムを使用することはできません。 多くのプロセススレッドを使用せず、リソースの使用量を減らす（アプリケーションの並行性を高める）ために、同じスレッドを使用して複数の並行処理を処理することができます。 したがって、 `ThreadLocals` を使用することはできません。さまざまな並行処理の間で値が漏れてしまうからです。

source: When using a regular class annotated with `@ConfigProperties` the class doesn't necessarily have to declare getters and setters. Having simple public non-final fields is valid as well.
ja_jp: `@ConfigProperties` でアノテーションされた通常のクラスを使用する場合、クラスは必ずしも getter および setter を宣言する必要はありません。単純でパブリックな確定的でないフィールドを持つことも有効です。

source: When using a traditional, blocking, and synchronous framework, processing of each request is performed in a dedicated thread.
ja_jp: 従来型の、ブロッキング、同期フレームワークを使う場合、各リクエストの処理は専用のスレッドで実行されます。

source: When using a traditional, blocking, and synchronous framework, processing of each request is performed in a dedicated thread. So, the same thread is used for the entire processing. You know that this thread will not be used to execute anything else until the completion of the processing. When you need to propagate data along the processing, such as the security principal or a trace id, you can use `ThreadLocals`. The propagated data is cleared once the processing is complete.
ja_jp: 伝統的な、ブロッキング、同期フレームワークを使う場合、各リクエストの処理は専用のスレッドで実行されます。 つまり、処理全体に対して同じスレッドが使われます。 このスレッドは、処理が完了するまで他の実行に使われることはありません。 セキュリティプリンシパルやトレース ID のような、処理に沿ったデータの伝搬が必要な場合は、 `ThreadLocals` を使うことができます。 伝搬されたデータは、処理が完了するとクリアされます。

source: When using cache it's very often important to have the option to invalidate a cache entry by the specific key. In Qute the key of a cache entry is a `String` that consist of the template name, line and column of the starting `{#cached}` tag and the optional `key` parameter: `{TEMPLATE}:{LINE}:{COLUMN}_{KEY}`. For example, `foo.html:10:1_alpha` is a key for the cached section in a template `foo.html`, the `{#cached}` tag is placed on the line 10, column 1. And the optional `key` parameter resolves to `alpha`.
ja_jp: キャッシュを使用する場合、特定のキーでキャッシュエントリーを無効にするオプションを持つことが非常に重要です。Qute では、キャッシュエントリーのキーは、テンプレート名、開始 `{#cached}` タグの行と列、およびオプションの `key` パラメーターで構成される `String` (`{TEMPLATE}:{LINE}:{COLUMN}_{KEY}`) です。たとえば、`foo.html:10:1_alpha` はテンプレート`foo.html` のキャッシュされたセクションのキーであり、`{#cached}` タグは 10 行目の 1 列目に配置されます。オプションの `key` パラメーターは `alpha` に解決されます。

source: When using classpath volumes, the location has to start with "classpath:". The file or folder "./file" from the project's classpath will be accessible at "/container/to" in the container.
ja_jp: クラスパス・ボリュームを使用する場合、場所は "classpath: "で始まる必要があります。プロジェクトのクラスパスにあるファイルやフォルダ "./file" は、コンテナ内の "/container/to" でアクセスできるようになります。

source: When using exactly-once processing, consumed message offset commits are handled by the transaction and therefore the application should not commit offsets through other means. The consumer should have `enable.auto.commit=false` (the default) and set explicitly `commit-strategy=ignore`:
ja_jp: exactly-once 処理を使用する場合、消費されたメッセージオフセットコミットはトランザクションによって処理されるため、アプリケーションは他の方法でオフセットをコミットしてはいけません。コンシューマーには `enable.auto.commit=false` (デフォルト) があり、明示的に `commit-strategy=ignore` を設定する必要があります。

source: When using exactly-once processing, messages can only be acked individually rather than cumulatively.
ja_jp: exactly-once を使用する場合、累積的にではなく、個別にのみメッセージを確認応答できます。

source: When using https://en.wikipedia.org/wiki/AArch64[AArch64] on macOS be aware of this https://github.com/grpc/grpc-java/issues/11844[issue]: meaning that the macOS https://en.wikipedia.org/wiki/X86[x86_64] protoc and macOS aarch_64 protoc are the `same` - both are macOS x86_64. So you need to enable https://en.wikipedia.org/wiki/Rosetta_(software)[Rosetta] (`softwareupdate --install-rosetta`) on your ARM based macOS if you want to generate protobuf classes.
ja_jp: macOS で https://en.wikipedia.org/wiki/AArch64[AArch64] を使用する場合、この https://github.com/grpc/grpc-java/issues/11844[問題] に注意してください。つまり、macOS の https://en.wikipedia.org/wiki/X86[x86_64] protoc と macOS の aarch_64 protoc は `同じ` であり、どちらも macOS x86_64 です。したがって、protobuf クラスを生成したい場合は、ARM ベースの macOS で https://en.wikipedia.org/wiki/Rosetta_(software)[Rosetta] (`softwareupdate --install-rosetta`) を有効にする必要があります。

source: When using loggers, the MDC (contextual data added to the log messages) is stored in duplicated context when available. Check the xref:logging.adoc#mdc-propagation[logging reference guide] for more details.
ja_jp: ロガーを使用する場合、MDC（ログ メッセージに追加されるコンテキスト データ）は、利用可能な場合、複製コンテキストに保存されます。 詳細については、 xref:logging.adoc#mdc-propagation[ロギング リファレンス ガイド] を確認してください。

source: When using messaging emitters, the context is not propagated by default.
ja_jp: メッセージング Emitter を使用する場合、コンテキストはデフォルトでは伝搬されません。

source: When using multiple clients, each `MongoClient`, you can select the client to inject using the `io.quarkus.mongodb.MongoClientName` qualifier. Using the above properties to configure three different clients, you can also inject each one as follows:
ja_jp: 複数のクライアントを使用する場合、各 `MongoClient` は、 `io.quarkus.mongodb.MongoClientName` の修飾子を使用して注入するクライアントを選択できます。上記のプロパティーを使用して、以下のように3つの異なるクライアントを設定し、それぞれに注入することもできます。

source: When using multiple clients, you can select the client to inject using the `io.quarkus.redis.client.RedisClientName` qualifier. Using the above properties to configure three different clients, you can also inject each one as follows:
ja_jp: 複数のクライアントを使用する場合は、 `io.quarkus.redis.client.RedisClientName` の修飾子を使用して注入するクライアントを選択することができます。上記のプロパティーを使って3つの異なるクライアントを設定すると、以下のようにそれぞれにインジェクションすることもできます。

source: When using multiple datasources, each `DataSource` also has the `io.quarkus.agroal.DataSource` qualifier with the name of the datasource as the value.
ja_jp: 複数のデータソースを使用する場合は、各 `DataSource` にデータソース名を値として指定した `io.quarkus.agroal.DataSource` 修飾子を付与してください。

source: When using multiple datasources, each `DataSource` also has the `io.quarkus.agroal.DataSource` qualifier with the name of the datasource as the value. Using the above properties to configure three different datasources, you can also inject each one as follows:
ja_jp: 複数のデータソースを使用する場合、それぞれの `DataSource` にも、値としてデータソース名のある `io.quarkus.agroal.DataSource` の修飾子が付けられています。上記のプロパティーを使って 3 つの異なるデータソースを設定すると、以下のようにそれぞれのデータソースを注入することもできます。

source: When using multiple test resources, they can be started concurrently. For that you need to set `@QuarkusTestResource(parallel = true)`.
ja_jp: 複数のテストリソースを使用する場合、それらを同時に開始できます。そのためには、 `@QuarkusTestResource(parallel = true)` を設定する必要があります。

source: When using named persistence units, you must set the `datasource` property to the name of the corresponding datasource.
ja_jp: 名前付き永続化ユニットを使用する場合、`datasource` プロパティーを対応するデータソースの名前に設定する必要があります。

source: When using native executables with GraalVM, all classes that will be used with reflection need to be registered. The good news is that Quarkus does that work for you most of the time. So far, we have not registered any class, not even `Fruit`, for reflection usage, and everything is working fine.
ja_jp: GraalVM でネイティブ実行可能ファイルを使用する場合、リフレクションで使用されるすべてのクラスを登録する必要があります。 幸いなことに、ほとんどの場合、Quarkus がその作業を自動的に実行します。 これまでのところ、`Fruit` を含め、リフレクションを使用するためのクラスを 1 つも登録していませんが、すべて正常に動作しています。

source: When using native executables with GraalVM, all classes that will be used with reflection need to be registered. The good news is that Quarkus does that work for you most of the time. So far, we haven't registered any class, not even `Fruit`, for reflection usage and everything is working fine.
ja_jp: GraalVMでネイティブ実行可能ファイルを使用する場合、リフレクションで使用されるすべてのクラスを登録する必要があります。良いニュースは、Quarkusがほとんどの場合、その作業を代行してくれるということです。これまでのところ、 `Fruit` でさえ、リフレクトを使用するためのクラスを登録しておらず、すべてが正常に動作しています。

source: When using native-image, the use of http (or https) protocol(s) must be declared
ja_jp: ネイティブイメージを使用する場合は、http (または https) プロトコルの使用を宣言しなければなりません。

source: When using offline startup, it's important to ensure that the database schema has already been created correctly before the application starts.
ja_jp: オフライン起動を使用する場合、アプリケーションが起動する前に、データベーススキーマが正しく作成されていることを確認することが重要です。

source: When using one of the built-in datasource kinds, the JDBC and Reactive drivers are resolved automatically to match the values from these tables.
ja_jp: ビルトインデータソースの種類のいずれかを使用する場合、JDBC ドライバーとリアクティブドライバーはこの表の値と一致するように自動的に解決されます。

source: When using one of the built-in datasource kinds, the JDBC driver is resolved automatically to the following values:
ja_jp: ビルトインデータソースのいずれかの種類を使用している場合、JDBC ドライバーは以下の値に自動的に解決されます。

source: When using regular expressions in an `application.properties` file, escape special characters with four backward slashes (`\\\\`) to ensure proper behavior. For example:
ja_jp: `application.properties` ファイルで正規表現を使用する場合は、適切な動作を確保するために、特殊文字を 4 つのバックスラッシュ (`\\\\`) でエスケープします。 たとえば:

source: When using the Gradle Groovy DSL, property keys must follow lower camel case notation. e.g. `container-build` is not valid, and should be replaced by `containerBuild`. This limitation does not apply to the Gradle Kotlin DSL.
ja_jp: Gradle Groovy DSL を使用する場合、プロパティーキーは小文字のキャメルケース表記に従わなければなりません。例: `container-build` は無効なので、 `containerBuild` で置き換えてください。この制限は Gradle Kotlin DSL には適用されません。

source: When using the Hibernate Search and Elasticsearch devservices, the Elasticsearch schema is now re-created on startup in tests and dev mode.
ja_jp: Hibernate Search および Elasticsearch devservices を使用する場合、テストおよび開発モードでの起動時に Elasticsearch スキーマが再作成されるようになりました。

source: When using the JBoss Logging API, your application requires no additional dependencies, as Quarkus automatically provides it.
ja_jp: JBoss Logging APIを使用する場合、Quarkusが自動的に提供するため、アプリケーションに追加の依存関係は必要ありません。

source: When using the JBoss Logging API, your application requires no additional dependencies, as {project-name} automatically provides it.
ja_jp: JBoss Logging APIを使用する場合、{project-name} が自動的に提供するため、アプリケーションに追加の依存関係は必要ありません。

source: When using the JBoss Logging API, your application requires no additional dependencies, as {project-name} provides it automatically.
ja_jp: JBoss Logging API を使用する場合、 {project-name} が自動的に提供するため、アプリケーションに追加の依存関係は必要ありません。

source: When using the Kotlin version of Hibernate ORM with Panache, note that the `PanacheEntity`, `PanacheQuery` and `PanacheRepository` are in a different package: `io.quarkus.hibernate.orm.panache.kotlin`.
ja_jp: KotlinバージョンのHibernate ORMをPanacheで使用する場合、 `PanacheEntity` 、 `PanacheQuery` 、 `PanacheRepository` は別のパッケージ: `io.quarkus.hibernate.orm.panache.kotlin` であることに注意してください。

source: When using the Quarkus (Vert.x-based) client, you can configure TLS by setting the following properties in your `application.properties` file:
ja_jp: Quarkus (Vert.x ベース) クライアントを使用する場合は、 `application.properties` ファイルで次のプロパティーを設定することで TLS を設定できます。

source: When using the Quarkus HTTP server (`quarkus.grpc.server.use-separate-server=false`) and Quarkus gRPC client (`quarkus.grpc.clients.hello.use-quarkus-grpc-client=true`), you can configure mTLS by setting the following properties in your `application.properties` file:
ja_jp: Quarkus HTTP サーバー (`quarkus.grpc.server.use-separate-server=false`) と Quarkus gRPC クライアント (`quarkus.grpc.clients.hello.use-quarkus-grpc-client=true`) を使用する場合、 `application.properties` ファイルで次のプロパティーを設定することで mTLS を設定できます。

source: When using the Quarkus Messaging extension for Kafka, we are able to propagate the span into the Kafka Record with:
ja_jp: Kafka の Quarkus Messaging エクステンションを使用する場合、 以下のようにして、スパンを Kafka レコードに伝播できます。

source: When using the Quarkus Spring Web compatibility layer on top of the reactive stack (`quarkus-rest-jackson`), you cannot inject servlet-based request and response types such as `jakarta.servlet.http.HttpServletRequest` or `jakarta.servlet.http.HttpServletResponse`. These types are only available when using the Classic RESTEasy stack (quarkus-resteasy / quarkus-resteasy-jackson), which relies on the Servlet API provided by `quarkus-undertow` dependency.
ja_jp: Reactive スタック (`quarkus-rest-jackson`) 上で Quarkus Spring Web 互換性レイヤーを使用する場合、`jakarta.servlet.http.HttpServletRequest` や `jakarta.servlet.http.HttpServletResponse` のようなサーブレットベースのリクエストおよびレスポンス型をインジェクションすることはできません。これらの型は、`quarkus-undertow` 依存関係によって提供される Servlet API に依存する Classic RESTEasy スタック (quarkus-resteasy / quarkus-resteasy-jackson) を使用している場合にのみ利用可能です。

source: When using the REST Client in dev mode, Quarkus has the ability to stand up a pass-through proxy which can be used as a target for Wireshark (or similar tools) in order to capture all the traffic originating from the REST Client (this really makes sense when the REST Client is used against HTTPS services)
ja_jp: 開発モードで REST クライアントを使用する際、Quarkus はパススループロキシーを立ち上げる機能を備えており、これを Wireshark (または類似のツール) のターゲットとして使用することで、 REST クライアントから発信されるすべてのトラフィックをキャプチャーすることができます (特に REST Client が HTTPS サービスに対して使用される場合に有用です）。

source: When using the SmallRye Reactive Messaging extension for Kafka, we are able to propagate the span into the Kafka Record with:
ja_jp: SmallRye Reactive Messaging extension for Kafkaを使用すると、スパンをKafka Recordに伝搬させることができます。

source: When using the TLS registry, you need to use a named configuration to avoid conflicts with other TLS configurations:
ja_jp: TLS レジストリーを使用する場合は、他の TLS 設定との競合を避けるために、名前付き設定を使用する必要があります。

source: When using the Typesafe GraphQL client with a certificate reloading mechanism, as described in the <<reloading-certificates>> section, it is essential to override the bean's scope to `RequestScoped` or another similar scope shorter than the application. This is because, by default, the Typesafe client is an application-scoped bean. Shortening the scope guarantees that new instances of the bean created after a certificate reload will be configured with the latest certificate. Dynamic clients are `@Dependent` scoped; inject them into components with an appropriate scope.
ja_jp: 証明書リロードメカニズムとともに Typesafe GraphQL クライアントを使用する場合 (<<reloading-certificates>> セクション参照)、Bean のスコープを `RequestScoped` またはアプリケーションより短い同様のスコープにオーバーライドする必要があります。 これは、デフォルトでは Typesafe クライアントがアプリケーションスコープの Bean であるためです。 スコープを短くすることで、証明書のリロード後に作成されたBean の新しいインスタンスが最新の証明書で設定されます。 動的クライアントは `@Dependent` スコープであるため、適切なスコープを持つコンポーネントに注入します。

source: When using the WebSocket client, using a _named_ configuration is required to avoid conflicts with other TLS configurations. The client will not use the default TLS configuration.
ja_jp: WebSocket クライアントを使用する場合は、他の TLS 設定との競合を避けるために、_名前付き_ 設定を使用する必要があります。 クライアントはデフォルトの TLS 設定を使用しません。

source: When using the _blocking_ variant, you can configure the default timeout with:
ja_jp: _ブロッキング_ バリアントを使う場合は、以下を使用してデフォルトのタイムアウトを設定することができます。

source: When using the `@Timed` annotation with Micrometer, 2 different metrics are https://github.com/open-telemetry/opentelemetry-java-instrumentation/blob/324fdbdd452ddffaf2da2c5bf004d8bb3fdfa1dd/instrumentation/micrometer/micrometer-1.5/library/src/main/java/io/opentelemetry/instrumentation/micrometer/v1_5/OpenTelemetryTimer.java#L31[created on the OpenTelemetry side], one `Gauge` for the `max` value and one `Histogram`.
ja_jp: Micrometer で `@Timed` アノテーションを使用する場合、2 つの異なるメトリクスが https://github.com/open-telemetry/opentelemetry-java-instrumentation/blob/324fdbdd452ddffaf2da2c5bf004d8bb3fdfa1dd/instrumentation/micrometer/micrometer-1.5/library/src/main/java/io/opentelemetry/instrumentation/micrometer/v1_5/OpenTelemetryTimer.java#L31[OpenTelemetry 側で作成] されます。1 つは、`max` 値用の `Gauge`、もう 1 つが `Histogram` です。

source: When using the `messaging-rabbitmq` extension there is no configuration needed. The extension will automatically recycle connections before their credentials expire based on the expiration timestamp provided by the Credentials Provider.
ja_jp: `messaging-rabbitmq` エクステンションを使用する場合、設定は不要です。 認証情報プロバイダによって提供される有効期限タイムスタンプに基づいて、エクステンションは認証情報の有効期限が切れる前に接続を自動的にリサイクルします。

source: When using the `persistence.xml` configuration you are configuring Hibernate ORM directly, so in this case the appropriate reference is the link:{hibernate-orm-docs-url}#configurations[documentation on hibernate.org].
ja_jp: `persistence.xml` で設定を使用する場合は、Hibernate ORM を直接設定することになるので、その場合は、link:{hibernate-orm-docs-url}#configurations[hibernate.org のドキュメント] を参照することが適切です。

source: When using the `persistence.xml` configuration you are configuring Hibernate ORM directly, so in this case the appropriate reference is the link:{orm-doc-url-prefix}#configurations[documentation on hibernate.org].
ja_jp: `persistence.xml` で設定を使用する場合は、Hibernate ORM を直接設定することになるので、その場合は link:{orm-doc-url-prefix}#configurations[hibernate.org のドキュメント] を参照するのが適切です。

source: When using the `quarkus-container-image-jib` extension to build a container image, then any label added via the aforementioned property will also be added to the generated container image.
ja_jp: `quarkus-container-image-jib` エクステンションモジュールを使用してコンテナーイメージを作成する場合、前述のプロパティーを介して追加されたラベルも生成されたコンテナーイメージに追加されます。

source: When using the `quarkus-kafka-client` extension, you can enable _readiness_ health check by setting the `quarkus.kafka.health.enabled` property to `true` in your `application.properties`. This check reports the status of the interaction with a _default_ Kafka broker (configured using `kafka.bootstrap.servers`). It requires an _admin connection_ with the Kafka broker, and it is disabled by default. If enabled, when you access the `/q/health/ready` endpoint of your application, you will have information about the connection validation status.
ja_jp: `quarkus-kafka-client` エクステンションを使用している場合、 `application.properties` で `quarkus.kafka.health.enabled` プロパティーを `true` に設定することで、_readiness_ ヘルスチェックを有効にすることができます。このチェックでは、_default_ Kafka ブローカー (`kafka.bootstrap.servers` を使用して設定) とのインタラクションのステータスが報告されます。これには Kafka ブローカーとの _admin connection_ が必要ですが、これはデフォルトでは無効になっています。有効にすると、アプリケーションの `/q/health/ready` エンドポイントにアクセスしたときに、接続検証のステータスに関する情報が得られます。

source: When using the `quarkus-resteasy-reactive-jackson` extension there are some advanced features that RESTEasy Reactive supports.
ja_jp: `quarkus-resteasy-reactive-jackson` エクステンションを使用する場合、RESTEasy Reactive がサポートするいくつかの高度な機能があります。

source: When using the `quarkus-resteasy-reactive-jaxb` extension there are some advanced features that Quarkus REST supports.
ja_jp: `quarkus-resteasy-reactive-jaxb` エクステンションを使用する場合、Quarkus REST がサポートする高度な機能がいくつかあります。

source: When using the `quarkus-resteasy-reactive-jaxb` extension there are some advanced features that RESTEasy Reactive supports.
ja_jp: `quarkus-resteasy-reactive-jaxb` エクステンションを使用する場合、RESTEasy Reactive がサポートするいくつかの高度な機能があります。

source: When using the `smallrye-reactive-messaging-rabbitmq` extension there is no configuration needed. The extension will automatically recycle connections before their credentials expire based on the expiration timestamp provided by the Credentials Provider.
ja_jp: `smallrye-reactive-messaging-rabbitmq` エクステンションを使用する場合、設定は不要です。 認証情報プロバイダによって提供される有効期限タイムスタンプに基づいて、エクステンションは認証情報の有効期限が切れる前に接続を自動的にリサイクルします。

source: When using the buildpack container image extension it is strongly advised to avoid adding `quarkus.container-image.build=true` in your properties configuration as it might trigger nesting builds within builds. It's preferable to pass it as an option to the build command instead.
ja_jp: buildpack コンテナイメージエクステンションを使用する際には、プロパティ設定に `quarkus.container-image.build=true` を追加しないことを強くお勧めします。代わりにビルドコマンドのオプションとして渡すことをお勧めします。

source: When using the default connection, you can inject the various APIS using a _plain_ `@Inject`:
ja_jp: デフォルトの接続を使用する場合、_プレーン_ `@Inject` を使用してさまざまな APIS を注入することができます。

source: When using the dev mode (e.g. running `./mvnw quarkus:dev`), you can see more information about which beans are being removed in the Dev UI.
ja_jp: 開発モードを使用している場合（例： `./mvnw quarkus:dev` を実行している場合）、どのBeanが削除されているかの詳細な情報をDev UIで見ることができます。

source: When using the dev mode (running `./mvnw clean compile quarkus:dev`), you can see more information about which beans are being removed:
ja_jp: 開発モードを使用している場合（例: `./mvnw clean compile quarkus:dev` を実行している場合）、どの Bean が削除されているかの詳細な情報を見ることができます。

source: When using the dev mode (running `./mvnw quarkus:dev`), you can see more information about which beans are being removed:
ja_jp: 開発モード (`./mvnw quarkus:dev` を実行) を使用すると、削除される Bean に関する詳細情報を確認できます。

source: When using the gRPC Java client, you can configure TLS by setting the following properties in your `application.properties` file:
ja_jp: gRPC Java クライアントを使用する場合、 `application.properties` ファイルで次のプロパティーを設定することで TLS を設定できます。

source: When using the gRPC Java server, you can configure mTLS by setting the following properties in your `application.properties` file: When using the Vert.x based server and Vert.x-based client, you can configure mTLS by setting the following properties in your `application.properties` file:
ja_jp: gRPC Java サーバーを使用する場合、 `application.properties` ファイルで次のプロパティーを設定することで mTLS を設定できます。 Vert.x ベースのサーバーと Vert.x ベースのクライアントを使用する場合、 `application.properties` ファイルで次のプロパティーを設定することで mTLS を設定できます。
